src/Enums/СтатусыВнутреннихЗаказов/СтатусыВнутреннихЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВнутреннихЗаказов</name>
  <enumValues>
    <name>КОбеспечению</name>
  </enumValues>
  <enumValues>
    <name>КВыполнению</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
</mdclass:Enum>

src/Enums/СтатусыВнутреннихЗаказов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Заполняет список выбора статуса, в зависимости от включенных опций
//
// Параметры:
//  ДанныеВыбора			 - СписокЗначений	 - заполняемый список значений
//  ИспользоватьСтатусЗакрыт - Булево			 - признак необходимости использования статуса "Закрыт"
//
Процедура ЗаполнитьСписокВыбора(ДанныеВыбора, ИспользоватьСтатусЗакрыт) Экспорт
	
	ДанныеВыбора.Очистить();
	
	// Безусловные статусы
	ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.КОбеспечению);
	ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.КВыполнению);
	
	Если ИспользоватьСтатусЗакрыт Тогда
		ДанныеВыбора.Добавить(Перечисления.СтатусыВнутреннихЗаказов.Закрыт);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
